<template>
  <div>
    <el-scrollbar style="height:280px;">
      <div style="padding-right:10px;">
        <p style="font-size:20px;margin: 0;text-align: center;">国脉虚拟股管理办法</p>
        <p style="font-weight: bold;">第一章 总则</p>
        <p>第一条 为规范公司投资行为，降低资本成本，减少投资风险，提高资金效益，依据国家有关财经法规规定指引，并结合公司具体情况制定本制度。</p>
        <p>第二条 本制度投资和退出流通货币均为国脉贝。</p>
        <p>第三条 释放流通股本、股本发行量、可分配利润由集团统一确定。</p>
        <p>第四条 投资的对象为国脉员工、外部投资企业（人）。</p>
        <p>第五条 投融资以自愿性为原则，集团不得以任何理由强迫投资行为。</p>
        <p>第六条 投资具有一定风险，集团不承诺任何固定收益。</p>
        <p>第七条 股份释放量和股份发行量一经确定，以先到先得的原则，成功交易后正式成为被投资组织的股东成员之一。</p>
        <p>第八条 投资金额优先用作被投资组织的注册实缴资金。</p>
        <p>第九条 组织估值由部门数据资产、财务资产等重要因素估值而出。</p>
        <p style="font-weight: bold;">第二章 投资定义</p>
        <p>第一条 股本定义，分为非流通股本和流通股本。两者相加即为总股本100%。</p>
        <p>第二条 非流通股本指少数股东持有大额股权且未释放公开认购；此类股本只可转让不可出售，可通过变更股东的方式进行增减持有。</p>
        <p>第三条 流通股本指集团或组织持有股权且释放公开认购。流通股本可以在投资管理中进行发行，用于普通用户的投资，且可转让或退股。</p>
        <p style="font-weight: bold;">第三章 投资规则</p>
        <p>第一条 初始发行股价，各部门的初始发行股价统一均为1国脉贝。</p>
        <p>第二条 首次投资和追加投资的股价都必须按当天最新发布的动态股价进行交易。</p>
        <p>第三条 动态股价受影响因素为数据资产、财务资产、净利润三大方面。</p>
        <p>第四条 动态股价定于每天早上8：45分公布，早上9：00至18：00作为计算动态股价的周期。</p>
        <p>第五条 正式人员和离职人员均可进行投资，集团将为离职人员保留其内网账号，归国脉校友组织管理，并受国脉集团投融资管理办法条例约束。</p>
        <p>第六条 所以一切投资交易行为都将被记录备案，做到一切有迹可循。</p>
        <p>第七条 投资与退股需明确要素：投资日期、投资组织、当日股价、购入（售出）数量、购入（出售）金额、投资买卖人等。</p>
        <p style="font-weight: bold;">第四章 投资流程</p>
        <p>第一条 投资购买股权激励组织清单——股权激励招募书——投资申请——投资须知和风险告知书——购买确认——国脉贝至总账户——收到确认——下发股权授予书——投资完成。</p>
        <p>第二条 退股申请填写退股申请书——系统受理——集团回收股权默认1:1退回国脉贝至个人账户或股本转嫁到第三方投资人——收到确认——终止投资。</p>
        <p style="font-weight: bold;">第五章 投资管理</p>
        <p>第一条 内网投融资必须遵守本制度，如发现有恶意操控国脉贝投资行为或其行为严重影响到投资环境，集团投融资管理员有权终止一切投资行为，且一年内不能再次参与投资。</p>
        <p>第二条 关于投资国脉贝的管理，由投融资专户统筹保管处理，再由集团投资管理员分配到各组织进行使用。</p>
        <p>第三条 组织可以通过上架和下架来进行管理股本发行量的变更。</p>
        <p>第四条 组织的投资上架和下架的行为不能随意，要对股东们利益负责。</p>
        <p>第五条 对变更发行股本数量的组织投资管理者需进行审核方可成功增减发行量。</p>
        <p>第六条 投资管理者对组织只有监督管理权，没有更改编辑数据的权力。</p>
        <p>第七条 如在股权激励和投资过程中，出现交易完成后国脉贝没到账的情况下，系统会执行自动扣款行为，并告知相关投资人。</p>
        <p>第八条 针对离职人员离职的情况，员工正式离职后仍然可以继续使用原有账号并持原购入的股本，离职行为不会对投资和投资分红产生任何影响。</p>
        <p>第九条 一旦离职人员在离职后申请退资成功，账户将会保留90天，如期间并未发生投资行为，账号会自动结束双方投资关系。</p>
        <p>第十条 股东们可在个人投资汇总表查看个人投资对比情况（当月的股价波动、利润对比等）。</p>
        <p>第十一条 集团高层可在资产概览的投资总结中查看总体投资情况。</p>
        <p>第十二条 因股权激励产生的红利收益通过内网提现时，需自行按照国家法律法规承担税费与规费。</p>
        <p style="font-weight: bold;">第六章 股本分红</p>
        <p>第一条 投资分红在投资组织当年盈利的情况下执行，按可分配利润进行计算分红。</p>
        <p>第二条 投资盈利分红以当年1月1日到12月31日为计算收益周期。分红一年一次，并以国脉贝形式于次年元月25号下发到个人国脉贝账户中，分红可继续用于正常投资不做任何限制。</p>
        <p>第三条 分红计算公式：每股分红=净利润（组织盈亏）*可分配比例/应分配股份数</p>
        <p style="font-weight: bold;">第七章 退出机制</p>
        <p>第一条 买卖家双方可通过投资转让平台进行交易，相互达成一致需签订一份转出协议以保障双方权益，其中产生的盈利和损失均与集团股东无关，买家也可以选择集团以初始发行股价1:1比例回收股权（持有期3个月或以上）。完成退股买卖交易，系统会下发股权授予书，同时代表一切权益与风险均自动转移到第三方投资者，最后投资终止。
          本管理办法暂定2019年9月1日起试行，一切解释归集团董事（会）所有。</p>
        <p style="text-align: right;font-size:15px;margin:0;">集团资产运营中心</p>
        <p style="text-align: right;font-size:15px;">2019年9月1日</p>
      </div>
    </el-scrollbar>
  </div>
</template>

<script>
export default {
  data () {
    return {
    }
  },
  computed: {
  },
  methods: {
  },
  created () {
  },
}
</script>
<style lang="scss" scoped>
p {
  text-indent: 2em;
}
</style>
