<template>
  <div class="culture">
    <h3>文化标语二十一条</h3>
    <div>
      （1）国脉人，人人都要成为专家！

      （2）国脉智慧，成就客户；提升绩效，创新价值

      （3）以奋斗者为本，做智慧国脉系

      （4）信息就是资源、知识就是财富、智慧就是力量

      （5）心态决定状态、思路决定出路、作为决定地位

      （6）常怀感激之情、常抱进取之心、常存敬畏之念

      （7）做中学，学中悟，悟中得；学习、思考、实践，巩固、提升和创新

      （8）伟大是熬出来的、成功是拼出来的、智慧是学出来的

      （9）执行力胜过一切竞争力！

      （10）有压力不要压抑，有危机感不要有焦虑感

      （11）把学习养成习惯、把思考当作乐趣、把挑战化为行动

      （12）结构就是力量、数据就是观点、图表就是本质、文字就是思想

      （13）每个方案都要做成作品，每个项目都要做成标本

      （14）激情是效率和质量的催化剂，创新是品质和价值的源动力

      （15）以客户成功而自豪，以团队成功而骄傲

      （16）在历史的长河中，留给自己美好回忆的总是在付出最多的时刻！

      （17）评测要求：理解指标、规范细心、高效准时、精益求精

      （18）规划要求：把握需求、前瞻未来、创新价值、形实结合

      （19）咨询要求：洞察本质、把脉现状、切中要害、确保可行

      （20）市场要求：价值导向、专家营销、立体开发、持续维护

      （21）平台要求：整合资源、精品服务、确保流量、彰显价值
    </div>
  </div>
</template>

<script>
export default {
  
}
</script>

<style lang="scss" scoped>
.culture {

}
</style>
