<template>
  <div class="group">
    <div>
      国脉，是大数据治理、数字政府、营商环境、数字经济、政务服务专业提供商。创新提出“软件+咨询+数据+平台+创新业务”五位一体服务模型，拥有数据基因(DNA)和水巢(DIPS)两大系列几十项软件产品，长期为中国智慧城市、智慧政府和智慧企业提供专业咨询规划和数据服务，运营电子政务、物联网、智慧城市、数邦客、司马钱、中船通、蟠桃会、仓颉数据元、国策数据等系列行业专业平台，广泛服务于信息中心、大数据局、行政服务中心等政府客户、中央企业和金融机构。
    </div>
    <iep-img :src="imgList[0]"></iep-img>
    <div>
      从2004年12月成立以来，已在全国七大区域设立20余家分支机构、5大技术研发基地、国脉研究院（智慧城市研究中心、“最多跑一次”改革发展研究中心、营商环境评价中心、互联网+政务评价中心、数字经济研究所、政策研究所等），投资建设国脉智慧产业城；服务客户2000余家，涵盖国家部委、省/市/区县级政府、上百家央企及部分世界500强企业等；执行项目5000余个，并帮助客户积极打造智慧城市、数字政府、“最多跑一次”、“互联网+政务服务”等项目创新标杆，引领组织变革、数据治理、流程再造新浪潮；连续多年开展中国政府网站评估（自2006年）、中国智慧城市发展水平评估（自2011年）、中国互联网+政务评选（自2015年）、中国营商环境评估（自2018年）等公益活动。
    </div>
    <iep-img :src="imgList[1]"></iep-img>
    <div>
      被业界誉为中国信息化民间智库知名品牌、电子政务优选咨询机构，国内首倡智慧政府理念，首创智慧城市、数据治理、互联网+政务服务评价体系，首推数据资产普查、全口径数据资源目录、数据元标准化、数源确认与供需对接、”最多跑一次”事项梳理、营商通等产品，信息资源编目、公共数据普查等业务全国占有率和影响力名列前茅。在积极拓展外延发展的同时，国脉也正加速自身内生变革和组织数字化转型，争做赋能共益组织。
      公司秉承“国脉智慧，成就客户”服务理念，确立先进的文化价值观和崭新的企业管理理念，致力以“网络价值构建师、数据治理架构师”身份服务好国家、地方、企业和员工。
    </div>
    <iep-img :src="imgList[2]"></iep-img>
  </div>
</template>

<script>
export default {
  props: {
    index: {
      type: String,
      default: '1',
    },
  },
  data () {
    return {
      imgList: ['/img/app/detail/img_001.webp', '/img/app/detail/img_002.webp', '/img/app/detail/img_003.webp'],
    }
  },
}
</script>

<style lang="scss" scoped>
.group {
  width: 100%;
  min-height: 100px;
  border: 1px solid #ddd;
  padding: 45px;
  div {
    line-height: 20px;
    margin: 20px 0;
  }
}
</style>
