<template>
  <div class="business">
    <h3>一、大数据（核心业务）</h3>
    <p> 1、管资产：数据资产登记（普查）管理系统与梳理服务……</p>
    <div> ——1/2全国市场，包括省、地市（直辖市区县）及厅级等</div>
    <p> 2、管目录：信息资源编目管理系统、基础/主题数据库梳理服务、数据元标准化管理系统、标签化管理系统…… </p>
    <div>——1/3全国市场，包括信息中心、行政服务中心、大数据局等</div>
    <p> 3、管共享：数据供需对接与认责管理平台、数据（事项）供需对接、数源确认与认责体系、数据管家（整套数据基因产品）、数据可视化…… </p>
    <div>——1/3全国市场，包括30个省级政务服务网、300个地市以上行政服务中心 </div>
    <p> 4、管业务：政务服务事项（最多跑一次）支撑管理平台、政府事项流程优化（服务支撑）系统、政府服务目录管理系统、行政服务中心综合服务系统…… </p>
    <p> 5、管应用：行业大数据整体解决方案（机管局管理与服务综合系统、城市大数据中心系统、智慧党建、科技、气象、政策、教育……） </p>
    <p> 6、管治理：数据治理评估系统、系统整合与数据体系规划、清洗比对入库、绩效评估、信息化项目管理…… </p>
    <p> 7、数据服务与生产：政务信息资源采集系统、平台数据资产保值增值、外部数据采集和购买增值服务……</p>
    <h3>二、智慧政府</h3>
    <div>——65%市场占有率，为1/3国家部委和220多个省市区政府常年提供规划、评估与咨询服务，规划咨询数量达到2000多个，评估达到9万个/次</div>
    <p>1、咨询研究：政府网站平台化发展咨询、信息化/电子政务等白皮书/蓝皮书撰写、公共服务资源梳理咨询、政府网站标准规范、管理制度设计方案……    </p>
    <p>2、互联网+政务：智慧政府发展规划/行动方案、网上办事大厅规划、政府网站公共服务平台规划与咨询、四大基础数据库规划、智能化公共服务平台规划、地方/行业电子政府规划   </p>
    <p>3、评估研究：电子政务绩效评估、政府网站用户体验测试、政府网站（群）日常检测、政府网站（群）评测、政府信息公开、在线能力评估……    </p>
    <p>4、外包服务：栏目运维外包、电子期刊内容外包、新媒体运营外包……    </p>
    <h3>三、智慧城市</h3>
    <div>——35%市场占有率，为全国100多个省、市、区、乡镇、社区等细分行业提供顶层设计、行动计划及建设实施方案咨询服务</div>
    <p>1、总体规划：智慧城市、园区、政务、产业、民生平台、应用系统发展规划/实施方案……</p>
    <p>2、行业咨询：可行性研究/建设运营过程咨询、大数据应用发展规划/实施方案、智慧城市试点及专项资金申报咨询、智慧交通/医疗/家居等应用系统研究、运维制度体系设计……</p>
    <p>3、评估研究：智慧城市标准设计与评估、智慧应用系统水平评估、行业应用解决方案评选、两化融合发展水平评估……</p>
    <p>4、外包服务：公共服务平台运营、智慧城市网络平台服务……</p>
    <h3>四、智慧企业</h3>
    <div>——85%市场占有率，首发智慧企业评估指标体系，为100余家中央企业和20多家金融机构提供咨询服务</div>
    <p>1、总体规划：企业网站（群）、内部门户网站（群）、网站八大能力建设总体规划、电子商务/互联网+/新媒体战略发展规划、传统企业互联网+转型规划……</p>
    <p>2、行业咨询：智慧企业发展理论与实践研究、企业互联网转型理论与实践研究、行业互联网战略转型专项研究、企业网站八大能力优化提升咨询、企业网站能力建设全年过程咨询、建设可行性研究、标准建设、视觉形象设计咨询……</p>
    <p>3、评估研究：智慧企业建设水平评估与提升、企业互联网战略转型发展水平评估、企业互联网战略转型平台评估、企业互联网网站（群）综合评估、企业网站能力建设整体评估……</p>
    <p>4、外包服务：企业网站（群）技术外包、企业网站（群）建设实施……</p>
  </div>
</template>

<style lang="scss" scoped>
.business {
  padding: 40px;
  h3 {
    color: #b81e27;
    font-size: 20px;
    line-height: 26px;
  }
  div {
    color: #2891BD;
    line-height: 26px;
  }
  p {
    line-height: 26px;
  }
}
</style>
