<template>
  <div class="learning-list">
    <div v-for="(item,index) in learningList" :key="index" class="piece">
      <span>{{item.text}}</span>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      learningList: [{ text: 'shiro框架的介绍和使用' }, { text: '城市数据中心的基因解码' }, { text: '国脉集团互助基金管理办法' }, { text: '国脉董字[2014]04号文件薪资福' }, { text: '公司文化内容的最新修订稿' }, { text: '着力打造卓越全球城市最优营商环境' }, { text: '国脉集团互助基金管理办法' }, { text: '项目开发的代码规范' }, { text: '利用OCR技术光学解析验证码' }, { text: '国脉互联伯乐机制' }, { text: '国脉集团互助基金管理办法' }, { text: '国脉董字[2014]04号文件薪资福' }, { text: '【20190215】报告撰写及细节规范' }, { text: '北京市政务服务（公共服务）事项规范填报说明培训' }, { text: '北京市区级政务服务事项标准化梳理动员部署会' }, { text: '20190226区块链点对点技术实现电子现金系统技术培训' }, { text: '20190215金超明培训js基础应用知识' }, { text: '20190222余奕旋培训常用前端框架使用' }, { text: '20190226陈振辉给佛山技术团队培训国脉GDS微服务开发框架' }, { text: '20190306研发中心俞泽益培训如何提高人员文档撰写能力及撰写规范' }, { text: '内网国脉贝管理与应用办法（试行）' }, { text: '上海市营商环境评估方案' }, { text: '2018政务大数据、数字政府理论与实践 高级研修班（第三期）' }, { text: '20181126区链链技术培训' }],
      readList: [{ text: '智能问答机器人项目分享' }, { text: '佛山政务服务微信公众平台建设及组织实施经验分享' }, { text: '佛山市互联网+政务服务内容分享' }, { text: '事项基因系统的发展' }, { text: '项目管理培训知识体系材料' }, { text: '安远县政务服务事项填报指南' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
      documentsList: [{ text: '222国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
      leadershipList: [{ text: '333国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
    }
  },
}
</script>
