<template>
  <div class="learning-list">
    <div v-for="(item,index) in learningList" :key="index" class="piece">
      <span>{{item.text}}</span>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      learningList: [{ text: '国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
      readList: [{ text: '111国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
      documentsList: [{ text: '222国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
      leadershipList: [{ text: '333国脉海洋获质量管理系认证' }, { text: '舟山国脉考察' }, { text: '中国建设银行总行首席经济学家黄志凌一行莅临舟山国脉考察' }, { text: '热烈庆祝广州国脉公司乔迁开业' }, { text: '国脉总经理郑爱军荣获“浙江创业女杰' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网两大研究中心简介' }, { text: '国脉物联网3.0版上线公告' }, { text: '国脉物联网3.0版上线公告' }],
    }
  },
}
</script>
