
exports.getEmployeeProfilePage = async function (ctx) {
  const data = {
    "code": 0, "msg": "success", "data": {
      "records": [
        {
          id: 1,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 2,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 3,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 4,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 5,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 6,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
        {
          id: 7,
          姓名: '李寅',
          性别: '女',
          部门: '国脉先锋队',
          入职时间: '2015-10-10',
          员工状态: '正式',
          岗位: '总经理',
          身份证号码: '33090219960103761X'
        },
      ], "total": 7, "size": 10, "current": 1, "searchCount": true, "pages": 1
    }
  }
  ctx.body = data;
}

exports.getAdministrativeApprovalPage = async function (ctx) {
  const data = {
    code: 0,
    msg: "success",
    data: {
      records: [
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        }
      ],
      total: 12,
      size: 10,
      current: 1,
      searchCount: true,
      pages: 1
    }
  }
  ctx.body = data;
}

exports.getTalentPoolPage = async function (ctx) {
  const data = {
    code: 0,
    msg: "success",
    data: {
      records: [
        {
          id: 1,
          姓名: "李银",
          性别: "女",
          学历: "年龄",
          应聘岗位: "网页设计",
          简历接受时间: "2019-01-20",
          来源: "官网"
        },
        {
          id: 1,
          姓名: "李银",
          性别: "女",
          学历: "年龄",
          应聘岗位: "网页设计",
          简历接受时间: "2019-01-20",
          来源: "官网"
        },
        {
          id: 1,
          姓名: "李银",
          性别: "女",
          学历: "年龄",
          应聘岗位: "网页设计",
          简历接受时间: "2019-01-20",
          来源: "官网"
        },
        {
          id: 1,
          姓名: "李银",
          性别: "女",
          学历: "年龄",
          应聘岗位: "网页设计",
          简历接受时间: "2019-01-20",
          来源: "官网"
        },
        {
          id: 1,
          姓名: "李银",
          性别: "女",
          学历: "年龄",
          应聘岗位: "网页设计",
          简历接受时间: "2019-01-20",
          来源: "官网"
        },
      ],
      total: 12,
      size: 10,
      current: 1,
      searchCount: true,
      pages: 1
    }
  }
  ctx.body = data;
}