exports.getEmployeeProfilePage = async function(ctx) {
  const data = {
    code: 0,
    msg: "success",
    data: {
      records: [
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        },
        {
          姓名: "李寅",
          性别: "女",
          部门: "国脉先锋队",
          入职时间: "2015-10-10",
          员工状态: "正式",
          岗位: "总经理",
          身份证号码: "33090219960103761X"
        }
      ],
      total: 7,
      size: 10,
      current: 1,
      searchCount: true,
      pages: 1
    }
  }
  ctx.body = data
}
exports.getAdministrativeApprovalPage = async function(ctx) {
  const data = {
    code: 0,
    msg: "success",
    data: {
      records: [
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        },
        {
          申请类型: "出差申请",
          申请人: "李百川",
          部门: "国脉先锋队",
          申请时间: "2015-10-10",
          审批人: "王璐燕",
          状态: "通过"
        }
      ],
      total: 12,
      size: 10,
      current: 1,
      searchCount: true,
      pages: 1
    }
  }
  ctx.body = data
}
